---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricHostReference
source: html/dd131f0d-8479-5f9b-49c2-3e3ac32151cf.htm
---
# Autodesk.Revit.DB.Structure.FabricHostReference

Controls if Single Fabric Sheet should be cut by the Host Cover.

## Syntax (C#)
```csharp
public enum FabricHostReference
```